/*!40101 SET NAMES utf8 */;
/*!40014 SET FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET SQL_NOTES=0 */;
DROP TABLE IF EXISTS donation;
CREATE TABLE `donation` (
  `id` int NOT NULL AUTO_INCREMENT,
  `donor_name` varchar(100) NOT NULL,
  `message` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `pay_won` int NOT NULL,
  `password` varchar(255) NOT NULL,
  `targetId` int NOT NULL,
  `x1_coord` float NOT NULL,
  `y1_coord` float NOT NULL,
  `x2_coord` float NOT NULL,
  `y2_coord` float NOT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_e4d196fad5b527519f8a579d2e6` (`targetId`),
  CONSTRAINT `FK_e4d196fad5b527519f8a579d2e6` FOREIGN KEY (`targetId`) REFERENCES `target` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=135 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
INSERT INTO donation(id,donor_name,message,phone,pay_won,password,targetId,x1_coord,y1_coord,x2_coord,y2_coord) VALUES(113,'박민준','벤치 있으면 편하겠다','1',30000,'1',2,0.078125,0.0714286,0.90625,0.153571),(114,'관리관','고생한다.','1',70000,'1',2,0.0732087,0.184397,0.903427,0.336879),(115,'대대장','여러분 다들 고생 많아요','1',100000,'1',2,0.0310559,0.433099,0.956522,0.556338),(116,'고경구','벤치 있으면 담배필때 개꿀일것 같습니다.','1',50000,'1',2,0.120743,0.559441,0.208978,0.944056),(117,'한정우','오, 저도 돈 같이 보태겠습니다.','1',50000,'1',2,0.763889,0.555556,0.856481,0.9375),(118,'행보관','체력단련 시간에 운동 열심히 하는 모습이 보기 좋네. 앞으로도 열심히 했으면 좋겠어.','+82 00-0000-0000',15000,'1234',12,0.63,0.0746667,0.588,0.370667),(119,'대대장','체력 단련을 통해 행복한 군생활이 됐으면 좋겠어요.','+82 00-0000-0000',100000,'1234',12,0.784,0.506667,0.016,0.666667),(120,'중대장','열심히 체력단련 하는 모습 보기좋더라. 너무 무리는 하지 말고 앞으로도 군생활 열심히 하자.','+82 00-0000-0000',10000,'1234',12,0.208,0.986667,0.106,0.650667),(121,'관리관','운동 열심히 해라.','+82 00-0000-0000',30000,'1234',12,0.462,0.44,0.734,0.845333),(122,'체계관리부사관','난 먼저 간다~ 고생해라 ㅋㅋㅋ','+82 00-0000-0000',15000,'1234',12,0.956,0.0106667,0.808,0.466667),(123,'주임원사','앞으로도 원활한 소통을 해줬으면 좋겠어~','+82 00-0000-0000',30000,'1234',12,0.992,0.541333,0.674,0.941333),(124,'대대장','이렇게 소통하는 모습 보기 좋네요. 앞으로도 건의사항 있으면 부담없이 말해주면 좋을거같아요.','+82 00-0000-0000',30000,'1234',1,0,0,0,0),(125,'전자과장','추운 겨울 난로와 함께 이겨내보자!','+82 00-0000-0000',20000,'1234',1,0,0,0,0),(126,'주파수관리관','따뜻하게 같이 군생활 하자~','+82 00-0000-0000',10000,'1234',1,0,0,0,0),(127,'중대장','겨울에도 따뜻한 군생활 하고 비전투 손실 안나게 주의하면서 생활 하자~','+82 00-0000-0000',20000,'1234',1,0,0,0,0),(128,'김유민','행정반 난로 가즈아~','+82 00-0000-0000',15000,'1234',1,0,0,0,0),(129,'김하민','행정반 난로.. 있으면 좋을수도~','+82 00-0000-0000',15000,'1234',1,0,0,0,0),(130,'지원과장','힘든 훈련 고생했어요. 회식하면서 충분히 쉬었으면 좋겠어요.','+82 10 0000 0000',100000,'1234',3,0,0,0,0),(131,'대대장','우리 대대원들이 열심히 노력해준 덕분에 훈련을 성공적으로 마칠 수 있었던거 같아요. 고생했고 회식 맛있게 하세요.','+82 00 0000 0000',200000,'1234',3,0,0,0,0),(133,'강진영','무야호','+82 10 0000 0000',50000,'1234',3,0,0,0,0);